Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F21A.tmx
Source language: en_us
Languages: zh_cn

source: Why You Should Celebrate Everything
zh_cn: 为每件事情庆贺

source: A day before my family arrived for Thanksgiving, my husband and I toasted to the carpet. It was still damp from the cleaning hours before, but it looked pristine.
zh_cn: 在我的家人来参加感恩节晚宴的头一天，我和丈夫为一张地毯而庆贺，地毯洗完几个小时有点潮湿，但在我看来并没什么不一样。

source: The next night, we celebrated the kickoff of the holiday season by watching our first-of-the-year holiday movie on cable.
zh_cn: 感恩节晚上，在假日频道我们以观看言情系列剧的第一季算是拉开了节日的序幕。

source: We've even been known to high-five the discovery of whole-wheat couscous.
zh_cn: 而后我们因发现了制作全麦蒸粗麦粉而击掌庆贺。

source: In ways both little and big, stupid and endearing, we celebrate just about everything.
zh_cn: 无论事情大小，烦人的或讨人喜欢的，我们都会为每件事而庆贺。

source: After 13 years of marriage, it isn't always smooth sailing around here.
zh_cn: 结婚13年了，生活并没有一帆风顺。

source: We bicker over parenting differences. I'm constantly annoyed when he comes home from the market with rotten or bruised produce.
zh_cn: 我们会因养儿育女的观点不同而互相争吵，每次他买回了烂的或者坏了的东西后我就会不停地叨唠。

source: He doesn't like when I interrupt or wander down the hall while talking.
zh_cn: 他在说话时最不喜欢我打断他或者在客厅里走来走去。

source: We have real-world challenges, but we give extra attention to the good things in life, too. We celebrate the little successes and that helps keep us connected.
zh_cn: 总之我们有着各种摩擦，但我们也会对生活中好的事情格外关注，对哪怕小小的成功也会进行庆贺以致这让我们又经常联系在一起。

source: I've also punctuated some great little life moments - when a client gave me a "job well done," when I secured a new assignment, when I found the thing I'd been looking for all week - quietly, alone, in my office, over a cup of coffee.
zh_cn: 我经常回忆那些小小的精彩瞬间，比如客户对我说“干得不错”，或者我被委派了新任务，或者找到了我一直在找的东西。我会在办公室安静地一人，品一杯咖啡以示庆贺。

source: And that works too, because any celebration, big or small, is really about taking a beat to notice the good stuff in your life. It can also be a reminder of our talents and abilities, skills and persistence. Drawing on those things can motivate us to keep working toward our goals.
zh_cn: 这很有效，因为不论大小的庆贺在你的生活中都会留下美好的回忆，它也是对我们的才能，行为，技能和坚持的一种回忆，借鉴这些事情能激发我们继续努力以达到我们的目标。

source: These moments of celebration make us pause and be mindful, and that boosts our well-being.
zh_cn: 庆贺时光能让我们驻足下来，细细回想，享受幸福的生活。

source: According to social psychology researcher Fred Bryant and others, when we stop to savor the good stuff, we buffer ourselves against the bad and build resilience - and even mini-celebrations can plump up the positive emotions which make it easier to manage the daily challenges that cause major stress.
zh_cn: 根据心理学家弗雷德布莱恩特和其他研究人员报告，当我们欣赏美好事物时，就会对不好的事情做个缓冲从而建立快速恢复的能力。即使微小的庆贺也能建立起积极的行动，它能让你更容易处理每天因压力而带来的挑战。

source: When we have something to look forward to, or look ahead to something worth celebrating, we feel more optimistic, according to research led by Hadassah Littman-Ovadia.
zh_cn: 据Hadassah Littman-Ovadia的研究表明：当我们有所期待或者有所庆贺时，我们就会变得更乐观。

source: It could be a new job, retirement, finishing a marathon - or something simpler but meaningful like a lunch with friends, a snow day, or a visit from the kids.
zh_cn: 它包括一份新工作，退职，马拉松竞赛，或者阅读书籍，甚至更简单的事情但更有意义比如和朋友的午餐，一个阳光明媚的日子或者小朋友的来访。

source: You don't need decorations or presents to savor a great moment. Just follow these steps and soak up the good feelings:
zh_cn: 你不需要一个华丽的装饰或者昂贵的礼物来增添庆贺的气氛，只需遵循以下几步就能让你有美好感觉。

source: Notice the moment.
zh_cn: 1.留意庆贺的时光。

source: What is it that you are proud of?
zh_cn: 什么事让你感到自豪？

source: What have you achieved today?
zh_cn: 今天取得了怎样的成就？

source: What do you like about your life?
zh_cn: 你想要怎样的生活？

source: Where is your good energy flowing?
zh_cn: 你的正能量来自哪里？

source: Notice what is working in your life and you'll find something to celebrate.
zh_cn: 意识到生活中工作是为了什么你就能从中找到庆贺的理由。

source: Perhaps a check came, or you finished a tough project, or handled a difficult moment with your child in a healthy, positive way. Maybe you helped someone else or found the courage to enroll in a continuing education program.
zh_cn: 支票兑现了，完成了一项复杂的工程，或者用健康积极的方式处理了孩子的问题，也可能是你帮助了其他人，找到了新的工作，找到了继续学习的动力。

source: Move out of the routine and set the scene.
zh_cn: 2.打破惯例，设定新场景。

source: Now, stop. Go to a special place in your home, or to a beautiful location outside and give your attention to the moment of goodness or achievement.
zh_cn: 停下所有，去到你家里的某个特别场地，或者室外惬意场所，然后将你所有的注意力集中到你的美好事情中或者你取得的成绩上。

source: Whatever you celebrate, set the moment apart by stepping out of your routine for just a few minutes.
zh_cn: 不管你庆贺什么事情，通过打破惯例为庆贺腾出那么几分钟。

source: Commemorate the moment.
zh_cn: 3.享受那美妙时光。

source: Now take some action:
zh_cn: 接着，开始吧。

source: Make a toast, say a prayer, take a bite of a special food, sing a song, high five, light a candle.
zh_cn: 烤块面包，念段祷文，吃点特制的食物，唱首歌，击个掌，点支蜡烛。

source: Animate the moment with a powerful, celebratory action that fires up positive energy, and enjoy the goodness that you have in your life.
zh_cn: 让强大的庆贺方式让这一刻充满鼓舞，激发我们的正能量，享受生活中一切美好的东西。

source: There will always be birthdays and big celebrations like Thanksgiving, graduations, and the fireworks of 4th of July to command our attention. And these are fun, for sure, but it's the mini-celebrations of the little moments that I come back to in the corners of my memory, because they have carried the most meaning.
zh_cn: 当然像生日还有感恩节，毕业典礼，独立日的烟花等大型的事件总会吸引着我们庆祝，毫无疑问这是非常棒的。但是我现在谈的是我记忆中那些非常细小的庆贺时刻。它们具有最大的意义。

source: One example is the e-mail I got announcing the sale of my first book, which I printed and fist-pumped over before saying a little prayer of gratitude.
zh_cn: 举其中一个例子，当我收到电子邮件知道了我出版的第一本书销售额时，在说出感激祷文之前我紧握拳头为自己打气。

source: Another is the weekly revelry on Friday at 4:15 when my husband throws open the front door and shouts, "It's the WEEKEND!"
zh_cn: 另一个是每周的例行狂欢，多数是在星期五的下午四点十五分，此时我丈夫推开前门并大声地说“周末到了！”

source: He acts like we aren't middle-aged parents who go to bed by 9 p.m. on Friday nights.
zh_cn: 他兴奋的样子都忘了我们是周五晚上必须睡觉的中年人。

source: We sit in the kitchen and toast each other, Friday, and the week's accomplishments.
zh_cn: 我们会坐在厨房里互相庆贺，为周五庆贺，为一周的成绩而庆贺。

source: We enjoy the moment and act like there is something big worth celebrating.
zh_cn: 我们会享受每一个庆贺时光，就像每件事情都值得庆贺一样。

source: If you go looking hard enough, there always is.
zh_cn: 只要你处处留心，它便处处存在。
